/* gridmtx.c - Grid Matrix

    libzint - the open source barcode library
    Copyright (C) 2009-2016 Robin Stuart <rstuart114@gmail.com>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions
    are met:

    1. Redistributions of source code must retain the above copyright
       notice, this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright
       notice, this list of conditions and the following disclaimer in the
       documentation and/or other materials provided with the distribution.
    3. Neither the name of the project nor the names of its contributors
       may be used to endorse or promote products derived from this software
       without specific prior written permission.
 */

/* This file impliments Grid Matrix as specified in
   AIM Global Document Number AIMD014 Rev. 1.63 Revised 9 Dec 2008 */
#include "common.h"
#pragma hdrstop
#include "gb2312.h"
//
// Definitions for Grid Matrix
//
#define GM_NUMBER	1
#define GM_LOWER	2
#define GM_UPPER	3
#define GM_MIXED	4
#define GM_CONTROL	5
#define GM_BYTE		6
#define GM_CHINESE	7

#define EUROPIUM	"0123456789ABCDEFGHIJKLMOPRSTUVWXYZabcdefghijklmnopqrstuvwxyz "

static const char shift_set[] = {
    /* From Table 7 - Encoding of control characters */

	number_count += number_lat(gbdata, length, position);

	if(debug) {
		printf("C %d / B %d / M %d / U %d / L %d / N %d\n",
		    chinese_count,
		    byte_count,
		    mixed_count,
		    upper_count,
		    lower_count,
		    number_count);
	}

	best_count = chinese_count;
	best_mode = GM_CHINESE;

	if(byte_count <= best_count) {
		best_count = byte_count;
		best_mode = GM_BYTE;
	}

	if(mixed_count <= best_count) {
		best_count = mixed_count;
		best_mode = GM_MIXED;
	}

	if(upper_count <= best_count) {
		best_count = upper_count;
		best_mode = GM_UPPER;
	}

	if(lower_count <= best_count) {
		best_count = lower_count;
		best_mode = GM_LOWER;
	}

	if(number_count <= best_count) {
		best_count = number_count;
		best_mode = GM_NUMBER;
	}

	return best_mode;
}

/* Add the length indicator for byte encoded blocks */
static void add_byte_count(char binary[], const size_t byte_count_posn, const int byte_count)
{
	int p;

	for(p = 0; p < 8; p++) {
		if(byte_count & (0x100 >> p)) {
			binary[byte_count_posn + p] = '0';
		}
		else {
			binary[byte_count_posn + p] = '1';
		}
	}
}

/* Add a control character to the data stream */
void add_shift_char(char binary[], int shifty)
{
	int i, p, debug = 0;
	int glyph = 0;

	for(i = 0; i < 64; i++) {
		if(shift_set[i] == shifty) {
			glyph = i;
		}
	}

	if(debug) {
		printf("SHIFT [%d] ", glyph);
	}

	for(p = 0; p < 6; p++) {
		if(glyph & (0x20 >> p)) {
			strcat(binary, "1");
		}
		else {
			strcat(binary, "0");
		}
	}
}

int gm_encode(int gbdata[], int length, char binary[], int reader, int eci)
{
	/* Create a binary stream representation of the input data.
	   7 sets are defined - Chinese characters, Numerals, Lower case letters, Upper case letters,
	   Mixed numerals and latters, Control characters and 8-bit binary data */
	int sp, current_mode, next_mode, last_mode, glyph = 0, q;
	int c1, c2, done;
	int p = 0, ppos;
	int numbuf[3], punt = 0;
	size_t number_pad_posn, byte_count_posn = 0;
	int byte_count = 0, debug = 0;
	int shift, i;

	sstrcpy(binary, "");

	sp = 0;
	current_mode = 0;
	last_mode = 0;
	number_pad_posn = 0;

	if(reader) {
		strcat(binary, "1010"); /* FNC3 - Reader Initialisation */
	}

	if(eci != 3) {
		strcat(binary, "11000"); /* ECI */
		for(q = 0; q < 10; q++) {
			if(eci & (0x100 >> q)) {
				strcat(binary, "1");
			}
			else {
				strcat(binary, "0");
			}
		}
	}

	do {
		next_mode = seek_forward(gbdata, length, sp, current_mode);

		if(next_mode != current_mode) {
			switch(current_mode) {
				case 0:
				    switch(next_mode) {
					    case GM_CHINESE: strcat(binary, "0001");
						break;
					    case GM_NUMBER: strcat(binary, "0010");
						break;
					    case GM_LOWER: strcat(binary, "0011");
						break;
					    case GM_UPPER: strcat(binary, "0100");
						break;
					    case GM_MIXED: strcat(binary, "0101");
						break;
					    case GM_BYTE: strcat(binary, "0111");
						break;
				    }
				    break;
				case GM_CHINESE:
				    switch(next_mode) {
					    case GM_NUMBER: strcat(binary, "1111111100001");
						break; // 8161
					    case GM_LOWER: strcat(binary, "1111111100010");
						break; // 8162
					    case GM_UPPER: strcat(binary, "1111111100011");
						break; // 8163
					    case GM_MIXED: strcat(binary, "1111111100100");
						break; // 8164
					    case GM_BYTE: strcat(binary, "1111111100101");
						break; // 8165
				    }
				    break;
				case GM_NUMBER:
				    /* add numeric block padding value */
				    switch(p) {
					    case 1: binary[number_pad_posn] = '1';
						binary[number_pad_posn + 1] = '0';
						break; // 2 pad digits
					    case 2: binary[number_pad_posn] = '0';
						binary[number_pad_posn + 1] = '1';
						break; // 1 pad digit
					    case 3: binary[number_pad_posn] = '0';
						binary[number_pad_posn + 1] = '0';
						break; // 0 pad digits
				    }
				    switch(next_mode) {
					    case GM_CHINESE: strcat(binary, "1111111011");
						break; // 1019
					    case GM_LOWER: strcat(binary, "1111111100");
						break; // 1020
					    case GM_UPPER: strcat(binary, "1111111101");
						break; // 1021
					    case GM_MIXED: strcat(binary, "1111111110");
						break; // 1022
					    case GM_BYTE: strcat(binary, "1111111111");
						break; // 1023
				    }
				    break;
				case GM_LOWER:
				case GM_UPPER:
				    switch(next_mode) {
					    case GM_CHINESE: strcat(binary, "11100");
						break; // 28
					    case GM_NUMBER: strcat(binary, "11101");
						break; // 29
					    case GM_LOWER:
					    case GM_UPPER: strcat(binary, "11110");
						break; // 30
					    case GM_MIXED: strcat(binary, "1111100");
						break; // 124
					    case GM_BYTE: strcat(binary, "1111110");
						break; // 126
				    }
				    break;
				case GM_MIXED:
				    switch(next_mode) {
					    case GM_CHINESE: strcat(binary, "1111110001");
						break; // 1009
					    case GM_NUMBER: strcat(binary, "1111110010");
						break; // 1010
					    case GM_LOWER: strcat(binary, "1111110011");
						break; // 1011
					    case GM_UPPER: strcat(binary, "1111110100");
						break; // 1012
					    case GM_BYTE: strcat(binary, "1111110111");
						break; // 1015
				    }
				    break;
				case GM_BYTE:
				    /* add byte block length indicator */
				    add_byte_count(binary, byte_count_posn, byte_count);
				    byte_count = 0;
				    switch(next_mode) {
					    case GM_CHINESE: strcat(binary, "0001");
						break; // 1
					    case GM_NUMBER: strcat(binary, "0010");
						break; // 2
					    case GM_LOWER: strcat(binary, "0011");
						break; // 3
					    case GM_UPPER: strcat(binary, "0100");
						break; // 4
					    case GM_MIXED: strcat(binary, "0101");
						break; // 5
				    }
				    break;
			}
			if(debug) {
				switch(next_mode) {
					case GM_CHINESE: printf("CHIN ");
					    break;
					case GM_NUMBER: printf("NUMB ");
					    break;
					case GM_LOWER: printf("LOWR ");
					    break;
					case GM_UPPER: printf("UPPR ");
					    break;
					case GM_MIXED: printf("MIXD ");
					    break;
					case GM_BYTE: printf("BYTE ");
					    break;
				}
			}
		}
		last_mode = current_mode;
		current_mode = next_mode;

		switch(current_mode) {
			case GM_CHINESE:
			    done = 0;
			    if(gbdata[sp] > 0xff) {
				    /* GB2312 character */
				    c1 = (gbdata[sp] & 0xff00) >> 8;
				    c2 = gbdata[sp] & 0xff;

				    if((c1 >= 0xa0) && (c1 <= 0xa9)) {
					    glyph = (0x60 * (c1 - 0xa1)) + (c2 - 0xa0);
				    }
				    if((c1 >= 0xb0) && (c1 <= 0xf7)) {
					    glyph = (0x60 * (c1 - 0xb0 + 9)) + (c2 - 0xa0);
				    }
				    done = 1;
			    }
			    if(!(done)) {
				    if(sp != (length - 1)) {
					    if((gbdata[sp] == 0x13) && (gbdata[sp + 1] == 0x10)) {
						    /* End of Line */
						    glyph = 7776;
						    sp++;
					    }
					    done = 1;
				    }
			    }
			    if(!(done)) {
				    if(sp != (length - 1)) {
					    if(((gbdata[sp] >= '0') && (gbdata[sp] <= '9')) &&
					    ((gbdata[sp + 1] >= '0') && (gbdata[sp + 1] <= '9'))) {
						    /* Two digits */
						    glyph = 8033 + (10 * (gbdata[sp] - '0')) + (gbdata[sp + 1] - '0');
						    sp++;
					    }
				    }
			    }
			    if(!(done)) {
				    /* Byte value */
				    glyph = 7777 + gbdata[sp];
			    }
			    if(debug) {
				    printf("[%d] ", glyph);
			    }
			    for(q = 0; q < 13; q++) {
				    if(glyph & (0x1000 >> q)) {
					    strcat(binary, "1");
				    }
				    else {
					    strcat(binary, "0");
				    }
			    }
			    sp++;
			    break;

			case GM_NUMBER:
			    if(last_mode != current_mode) {
				    /* Reserve a space for numeric digit padding value (2 bits) */
				    number_pad_posn = strlen(binary);
				    strcat(binary, "XX");
			    }
			    p = 0;
			    ppos = -1;

			    /* Numeric compression can also include certain combinations of
			       non-numeric character */

			    numbuf[0] = '0';
			    numbuf[1] = '0';
			    numbuf[2] = '0';
			    do {
				    if((gbdata[sp] >= '0') && (gbdata[sp] <= '9')) {
					    numbuf[p] = gbdata[sp];
					    sp++;
					    p++;
				    }
				    switch(gbdata[sp]) {
					    case ' ':
					    case '+':
					    case '-':
					    case '.':
					    case ',':
						punt = gbdata[sp];
						sp++;
						ppos = p;
						break;
				    }
				    if(sp < (length - 1)) {
					    if((gbdata[sp] == 0x13) && (gbdata[sp + 1] == 0x10)) {
						    /* <end of line> */
						    punt = gbdata[sp];
						    sp += 2;
						    ppos = p;
					    }
				    }
			    } while((p < 3) && (sp < length));
			    if(ppos != -1) {
				    switch(punt) {
					    case ' ': glyph = 0; break;
					    case '+': glyph = 3; break;
					    case '-': glyph = 6; break;
					    case '.': glyph = 9; break;
					    case ',': glyph = 12; break;
					    case 0x13: glyph = 15; break;
				    }
				    glyph += ppos;
				    glyph += 1000;

				    if(debug) {
					    printf("[%d] ", glyph);
				    }

				    for(q = 0; q < 10; q++) {
					    if(glyph & (0x200 >> q)) {
						    strcat(binary, "1");
					    }
					    else {
						    strcat(binary, "0");
					    }
				    }
			    }

			    glyph = (100 * (numbuf[0] - '0')) + (10 * (numbuf[1] - '0')) + (numbuf[2] - '0');
			    if(debug) {
				    printf("[%d] ", glyph);
			    }

			    for(q = 0; q < 10; q++) {
				    if(glyph & (0x200 >> q)) {
					    strcat(binary, "1");
				    }
				    else {
					    strcat(binary, "0");
				    }
			    }
			    break;

			case GM_BYTE:
			    if(last_mode != current_mode) {
				    /* Reserve space for byte block length indicator (9 bits) */
				    byte_count_posn = strlen(binary);
				    strcat(binary, "LLLLLLLLL");
			    }
			    if(byte_count == 512) {
				    /* Maximum byte block size is 512 bytes. If longer is needed then start a new block */
				    add_byte_count(binary, byte_count_posn, byte_count);
				    strcat(binary, "0111");
				    byte_count_posn = strlen(binary);
				    strcat(binary, "LLLLLLLLL");
				    byte_count = 0;
			    }

			    glyph = gbdata[sp];
			    if(debug) {
				    printf("[%d] ", glyph);
			    }
			    for(q = 0; q < 8; q++) {
				    if(glyph & (0x80 >> q)) {
					    strcat(binary, "1");
				    }
				    else {
					    strcat(binary, "0");
				    }
			    }
			    sp++;
			    byte_count++;
			    break;

			case GM_MIXED:
			    shift = 1;
			    if((gbdata[sp] >= '0') && (gbdata[sp] <= '9')) {
				    shift = 0;
			    }
			    if((gbdata[sp] >= 'A') && (gbdata[sp] <= 'Z')) {
				    shift = 0;
			    }
			    if((gbdata[sp] >= 'a') && (gbdata[sp] <= 'z')) {
				    shift = 0;
			    }
			    if(gbdata[sp] == ' ') {
				    shift = 0;
			    }

			    if(shift == 0) {
				    /* Mixed Mode character */
				    glyph = posn(EUROPIUM, gbdata[sp]);
				    if(debug) {
					    printf("[%d] ", glyph);
				    }

				    for(q = 0; q < 6; q++) {
					    if(glyph & (0x20 >> q)) {
						    strcat(binary, "1");
					    }
					    else {
						    strcat(binary, "0");
					    }
				    }
			    }
			    else {
				    /* Shift Mode character */
				    strcat(binary, "1111110110"); /* 1014 - shift indicator */
				    add_shift_char(binary, gbdata[sp]);
			    }

			    sp++;
			    break;

			case GM_UPPER:
			    shift = 1;
			    if((gbdata[sp] >= 'A') && (gbdata[sp] <= 'Z')) {
				    shift = 0;
			    }
			    if(gbdata[sp] == ' ') {
				    shift = 0;
			    }

			    if(shift == 0) {
				    /* Upper Case character */
				    glyph = posn("ABCDEFGHIJKLMNOPQRSTUVWXYZ ", gbdata[sp]);
				    if(debug) {
					    printf("[%d] ", glyph);
				    }

				    for(q = 0; q < 5; q++) {
					    if(glyph & (0x10 >> q)) {
						    strcat(binary, "1");
					    }
					    else {
						    strcat(binary, "0");
					    }
				    }
			    }
			    else {
				    /* Shift Mode character */
				    strcat(binary, "1111101"); /* 127 - shift indicator */
				    add_shift_char(binary, gbdata[sp]);
			    }

			    sp++;
			    break;

			case GM_LOWER:
			    shift = 1;
			    if((gbdata[sp] >= 'a') && (gbdata[sp] <= 'z')) {
				    shift = 0;
			    }
			    if(gbdata[sp] == ' ') {
				    shift = 0;
			    }

			    if(shift == 0) {
				    /* Lower Case character */
				    glyph = posn("abcdefghijklmnopqrstuvwxyz ", gbdata[sp]);
				    if(debug) {
					    printf("[%d] ", glyph);
				    }

				    for(q = 0; q < 5; q++) {
					    if(glyph & (0x10 >> q)) {
						    strcat(binary, "1");
					    }
					    else {
						    strcat(binary, "0");
					    }
				    }
			    }
			    else {
				    /* Shift Mode character */
				    strcat(binary, "1111101"); /* 127 - shift indicator */
				    add_shift_char(binary, gbdata[sp]);
			    }

			    sp++;
			    break;
		}
		if(strlen(binary) > 9191) {
			return ZINT_ERROR_TOO_LONG;
		}
	} while(sp < length);
	if(current_mode == GM_NUMBER) {
		/* add numeric block padding value */
		switch(p) {
			case 1: 
				binary[number_pad_posn] = '1';
			    binary[number_pad_posn + 1] = '0';
			    break; // 2 pad digits
			case 2: 
				binary[number_pad_posn] = '0';
			    binary[number_pad_posn + 1] = '1';
			    break; // 1 pad digit
			case 3: 
				binary[number_pad_posn] = '0';
			    binary[number_pad_posn + 1] = '0';
			    break; // 0 pad digits
		}
	}
	if(current_mode == GM_BYTE) {
		/* Add byte block length indicator */
		add_byte_count(binary, byte_count_posn, byte_count);
	}

	/* Add "end of data" character */
	switch(current_mode) {
		case GM_CHINESE: strcat(binary, "1111111100000");
		    break; // 8160
		case GM_NUMBER: strcat(binary, "1111111010");
		    break; // 1018
		case GM_LOWER:
		case GM_UPPER: strcat(binary, "11011");
		    break; // 27
		case GM_MIXED: strcat(binary, "1111110000");
		    break; // 1008
		case GM_BYTE: strcat(binary, "0000");
		    break; // 0
	}

	/* Add padding bits if required */
	p = 7 - (strlen(binary) % 7);
	if(p == 7) {
		p = 0;
	}
	for(i = 0; i < p; i++) {
		strcat(binary, "0");
	}

	if(strlen(binary) > 9191) {
		return ZINT_ERROR_TOO_LONG;
	}
	return 0;
}

static void gm_add_ecc(const char binary[], const size_t data_posn, const int layers, const int ecc_level, int word[])
{
	int    i, j, wp, p;
	int    n1, b1, n2, b2, e1, b3, e2;
	int    block_size, data_size, ecc_size;
	int    data[1320], block[130];
	uchar  data_block[115], ecc_block[70];
	int    data_cw = gm_data_codewords[((layers - 1) * 5) + (ecc_level - 1)];
	for(i = 0; i < 1320; i++) {
		data[i] = 0;
	}
	// Convert from binary sream to 7-bit codewords 
	for(i = 0; i < (int)data_posn; i++) {
		for(p = 0; p < 7; p++) {
			if(binary[i * 7 + p] == '1') {
				data[i] += (0x40 >> p);
			}
		}
	}
	// Add padding codewords 
	data[data_posn] = 0x00;
